experiments/d3000-pkvm-apps/results/d3000-apps-20260713-111300/pair-1/nvhe/redis-r1-steady/rep-04/memtier.txt
4         Threads
25        Connections per thread
300       Seconds


ALL STATS
============================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec 
--------------------------------------------------------------------------------------------------------------------------------------------
Sets         8545.96          ---          ---         0.70594         0.72700         0.81500         1.44700         1.51100      8895.15 
Gets        85458.17     85458.17         0.00         0.69487         0.71900         0.78300         1.43900         1.51100     88532.76 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---          --- 
Totals      94004.13     85458.17         0.00         0.69588         0.71900         0.79100         1.43900         1.51100     97427.91 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.023        0.000
SET       0.351        5.000
SET       0.583       10.000
SET       0.671       15.000
SET       0.687       20.000
SET       0.695       25.000
SET       0.703       30.000
SET       0.711       35.000
SET       0.719       40.000
SET       0.727       45.000
SET       0.727       50.000
SET       0.735       52.500
SET       0.735       55.000
SET       0.735       57.500
SET       0.735       60.000
SET       0.743       62.500
SET       0.743       65.000
SET       0.743       67.500
SET       0.743       70.000
SET       0.751       72.500
SET       0.751       75.000
SET       0.751       76.250
SET       0.751       77.500
SET       0.751       78.750
SET       0.751       80.000
SET       0.759       81.250
SET       0.759       82.500
SET       0.759       83.750
SET       0.759       85.000
SET       0.759       86.250
SET       0.759       87.500
SET       0.767       88.125
SET       0.767       88.750
SET       0.767       89.375
SET       0.767       90.000
SET       0.767       90.625
SET       0.767       91.250
SET       0.775       91.875
SET       0.775       92.500
SET       0.783       93.125
SET       0.783       93.750
SET       0.791       94.062
SET       0.799       94.375
SET       0.807       94.688
SET       0.815       95.000
SET       0.831       95.312
SET       0.855       95.625
SET       0.879       95.938
SET       0.903       96.250
SET       0.935       96.562
SET       0.967       96.875
SET       0.975       97.031
SET       0.991       97.188
SET       1.007       97.344
SET       1.031       97.500
SET       1.103       97.656
SET       1.255       97.812
SET       1.327       97.969
SET       1.359       98.125
SET       1.383       98.281
SET       1.399       98.438
SET       1.407       98.516
SET       1.415       98.594
SET       1.423       98.672
SET       1.431       98.750
SET       1.439       98.828
SET       1.439       98.906
SET       1.447       98.984
SET       1.455       99.062
SET       1.455       99.141
SET       1.463       99.219
SET       1.463       99.258
SET       1.463       99.297
SET       1.471       99.336
SET       1.471       99.375
SET       1.471       99.414
SET       1.471       99.453
SET       1.479       99.492
SET       1.479       99.531
SET       1.479       99.570
SET       1.487       99.609
SET       1.487       99.629
SET       1.487       99.648
SET       1.487       99.668
SET       1.487       99.688
SET       1.487       99.707
SET       1.487       99.727
SET       1.495       99.746
SET       1.495       99.766
SET       1.495       99.785
SET       1.495       99.805
SET       1.503       99.814
SET       1.503       99.824
SET       1.503       99.834
SET       1.503       99.844
SET       1.503       99.854
SET       1.503       99.863
SET       1.511       99.873
SET       1.511       99.883
SET       1.511       99.893
SET       1.511       99.902
SET       1.519       99.907
SET       1.519       99.912
SET       1.519       99.917
SET       1.519       99.922
SET       1.527       99.927
SET       1.527       99.932
SET       1.527       99.937
SET       1.535       99.941
SET       1.535       99.946
SET       1.543       99.951
SET       1.543       99.954
SET       1.543       99.956
SET       1.543       99.958
SET       1.551       99.961
SET       1.551       99.963
SET       1.551       99.966
SET       1.559       99.968
SET       1.559       99.971
SET       1.567       99.973
SET       1.567       99.976
SET       1.575       99.977
SET       1.575       99.978
SET       1.575       99.979
SET       1.583       99.980
SET       1.583       99.982
SET       1.583       99.983
SET       1.583       99.984
SET       1.591       99.985
SET       1.599       99.987
SET       1.599       99.988
SET       1.599       99.988
SET       1.607       99.989
SET       1.607       99.990
SET       1.615       99.990
SET       1.615       99.991
SET       1.623       99.991
SET       1.623       99.992
SET       1.631       99.993
SET       1.639       99.993
SET       1.655       99.994
SET       1.663       99.994
SET       1.679       99.995
SET       1.695       99.995
SET       1.711       99.995
SET       1.751       99.995
SET       1.783       99.996
SET       1.823       99.996
SET       1.879       99.996
SET       1.951       99.997
SET       2.063       99.997
SET       2.111       99.997
SET       2.111       99.997
SET       2.143       99.997
SET       2.159       99.998
SET       2.175       99.998
SET       2.207       99.998
SET       2.223       99.998
SET       2.255       99.998
SET       2.303       99.998
SET       2.335       99.998
SET       2.383       99.999
SET       2.431       99.999
SET       2.447       99.999
SET       2.495       99.999
SET       2.527       99.999
SET       2.559       99.999
SET       2.591       99.999
SET       2.623       99.999
SET       2.639       99.999
SET       2.671       99.999
SET       2.719       99.999
SET       2.719       99.999
SET       2.735       99.999
SET       2.767       99.999
SET       2.799       99.999
SET       2.815       99.999
SET       2.815      100.000
SET       2.847      100.000
SET       2.847      100.000
SET       2.895      100.000
SET       2.895      100.000
SET       2.927      100.000
SET       2.927      100.000
SET       2.943      100.000
SET       2.943      100.000
SET       2.959      100.000
SET       2.959      100.000
SET       2.991      100.000
SET       2.991      100.000
SET       3.023      100.000
SET       3.023      100.000
SET       3.023      100.000
[...]
SET       3.071      100.000
SET       3.071      100.000
SET       3.071      100.000
[...]
SET       3.119      100.000
SET       3.119      100.000
SET       3.119      100.000
[...]
SET       3.775      100.000
SET       3.775      100.000
SET       3.775      100.000
[...]
SET       4.351      100.000
SET       4.351      100.000
---
GET       0.023        0.000
GET       0.335        5.000
GET       0.567       10.000
GET       0.671       15.000
GET       0.679       20.000
GET       0.695       25.000
GET       0.703       30.000
GET       0.703       35.000
GET       0.711       40.000
GET       0.719       45.000
GET       0.719       50.000
GET       0.727       52.500
GET       0.727       55.000
GET       0.727       57.500
GET       0.727       60.000
GET       0.727       62.500
GET       0.735       65.000
GET       0.735       67.500
GET       0.735       70.000
GET       0.735       72.500
GET       0.735       75.000
GET       0.735       76.250
GET       0.743       77.500
GET       0.743       78.750
GET       0.743       80.000
GET       0.743       81.250
GET       0.743       82.500
GET       0.743       83.750
GET       0.743       85.000
GET       0.743       86.250
GET       0.751       87.500
GET       0.751       88.125
GET       0.751       88.750
GET       0.751       89.375
GET       0.751       90.000
GET       0.751       90.625
GET       0.751       91.250
GET       0.759       91.875
GET       0.759       92.500
GET       0.759       93.125
GET       0.767       93.750
GET       0.767       94.062
GET       0.775       94.375
GET       0.775       94.688
GET       0.783       95.000
GET       0.791       95.312
GET       0.807       95.625
GET       0.831       95.938
GET       0.847       96.250
GET       0.871       96.562
GET       0.903       96.875
GET       0.927       97.031
GET       0.943       97.188
GET       0.959       97.344
GET       0.983       97.500
GET       1.007       97.656
GET       1.095       97.812
GET       1.247       97.969
GET       1.327       98.125
GET       1.359       98.281
GET       1.383       98.438
GET       1.391       98.516
GET       1.399       98.594
GET       1.407       98.672
GET       1.415       98.750
GET       1.423       98.828
GET       1.431       98.906
GET       1.439       98.984
GET       1.447       99.062
GET       1.447       99.141
GET       1.455       99.219
GET       1.455       99.258
GET       1.463       99.297
GET       1.463       99.336
GET       1.463       99.375
GET       1.463       99.414
GET       1.471       99.453
GET       1.471       99.492
GET       1.471       99.531
GET       1.479       99.570
GET       1.479       99.609
GET       1.479       99.629
GET       1.479       99.648
GET       1.479       99.668
GET       1.487       99.688
GET       1.487       99.707
GET       1.487       99.727
GET       1.487       99.746
GET       1.487       99.766
GET       1.495       99.785
GET       1.495       99.805
GET       1.495       99.814
GET       1.495       99.824
GET       1.495       99.834
GET       1.495       99.844
GET       1.503       99.854
GET       1.503       99.863
GET       1.503       99.873
GET       1.503       99.883
GET       1.503       99.893
GET       1.511       99.902
GET       1.511       99.907
GET       1.511       99.912
GET       1.511       99.917
GET       1.511       99.922
GET       1.519       99.927
GET       1.519       99.932
GET       1.519       99.937
GET       1.519       99.941
GET       1.527       99.946
GET       1.527       99.951
GET       1.527       99.954
GET       1.535       99.956
GET       1.535       99.958
GET       1.535       99.961
GET       1.543       99.963
GET       1.543       99.966
GET       1.551       99.968
GET       1.551       99.971
GET       1.559       99.973
GET       1.559       99.976
GET       1.567       99.977
GET       1.567       99.978
GET       1.567       99.979
GET       1.575       99.980
GET       1.575       99.982
GET       1.583       99.983
GET       1.583       99.984
GET       1.591       99.985
GET       1.591       99.987
GET       1.599       99.988
GET       1.599       99.988
GET       1.599       99.989
GET       1.599       99.990
GET       1.607       99.990
GET       1.607       99.991
GET       1.615       99.991
GET       1.615       99.992
GET       1.623       99.993
GET       1.631       99.993
GET       1.647       99.994
GET       1.655       99.994
GET       1.671       99.995
GET       1.687       99.995
GET       1.719       99.995
GET       1.751       99.995
GET       1.791       99.996
GET       1.831       99.996
GET       1.887       99.996
GET       1.959       99.997
GET       2.023       99.997
GET       2.047       99.997
GET       2.079       99.997
GET       2.095       99.997
GET       2.111       99.998
GET       2.127       99.998
GET       2.143       99.998
GET       2.159       99.998
GET       2.191       99.998
GET       2.207       99.998
GET       2.223       99.998
GET       2.239       99.999
GET       2.239       99.999
GET       2.255       99.999
GET       2.271       99.999
GET       2.287       99.999
GET       2.319       99.999
GET       2.335       99.999
GET       2.399       99.999
GET       2.447       99.999
GET       2.495       99.999
GET       2.527       99.999
GET       2.559       99.999
GET       2.591       99.999
GET       2.639       99.999
GET       2.687       99.999
GET       2.719       99.999
GET       2.767      100.000
GET       2.831      100.000
GET       2.895      100.000
GET       3.039      100.000
GET       3.167      100.000
GET       3.455      100.000
GET       3.759      100.000
GET       3.807      100.000
GET       4.047      100.000
GET       4.127      100.000
GET       4.159      100.000
GET       4.223      100.000
GET       4.255      100.000
GET       4.287      100.000
GET       4.287      100.000
GET       4.287      100.000
GET       4.319      100.000
GET       4.351      100.000
GET       4.351      100.000
GET       4.351      100.000
[...]
GET       4.383      100.000
GET       4.383      100.000
GET       4.383      100.000
[...]
GET       4.415      100.000
GET       4.415      100.000
GET       4.415      100.000
[...]
GET       4.447      100.000
GET       4.447      100.000
GET       4.447      100.000
[...]
GET       4.479      100.000
GET       4.479      100.000
GET       4.479      100.000
[...]
GET       4.511      100.000
GET       4.511      100.000
GET       4.511      100.000
[...]
GET       4.543      100.000
GET       4.543      100.000
GET       4.543      100.000
[...]
GET       4.607      100.000
GET       4.607      100.000
---
WAIT      0.000      100.000